app/controllers/public/customers_controller.rb

UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "宇宙の果て"], ["updated_at", "2023-02-25 05:22:24.456265"], ["id", 1]]
---
  def update
    @customer = current_customer
    if @current_customer.update(customer_params)