app/controllers/public/sessions_controller.rb

  def customer_state
    @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "satou@gmail.com"], ["LIMIT", 1]]